console.log("poemData loaded");

/*

=========================================================

poemData.js

作品データ

=========================================================

*/

/*

---------------------------------------------------------

タイトル

---------------------------------------------------------

*/

const TITLE = {

    characters: [

        { text: "‐", x: 1790, y: 115, class: "titleChar" },

        { text: "■", x: 1790, y: 185, class: "titleChar" },

        { text: "ど", x: 1790, y: 255, class: "titleChar" },

        { text: "︵", x: 1790, y: 335, class: "titleChar" },

        { text: "う", x: 1790, y: 405, class: "titleChar" },

        { text: "し", x: 1790, y: 475, class: "titleChar" },

        { text: "ろ", x: 1790, y: 545, class: "titleChar" },

        { text: "■", x: 1790, y: 625, class: "titleChar" },

        { text: "︵", x: 1790, y: 705, class: "titleChar" },

        { text: "#", x: 1788, y: 775, class: "titleChar" },

        { text: "、", x: 1796, y: 845, class: "titleChar" }

    ]

};

const AUTHOR = {

    characters: [

        { text: "平", x: 1720, y: 1490, class: "authorChar" },

        { text: "川", x: 1720, y: 1555, class: "authorChar" },

        { text: "綾", x: 1720, y: 1620, class: "authorChar" },

        { text: "真", x: 1720, y: 1685, class: "authorChar" },

        { text: "智", x: 1720, y: 1750, class: "authorChar" }

    ]

};

const specialCharacters = {

    "#": { horizontal: true, dx: -16, dy: 10 },
    "👣": { rotate: -90, dx: -20, dy: 18 },
    "bar": { horizontal: true, dx: 0, dy: 0 },

    "0": { horizontal: true, dx: -14, dy: 2 },
    "1": { horizontal: true, dx: -14, dy: 2 },
    "2": { horizontal: true, dx: -14, dy: 2 },
    "3": { horizontal: true, dx: -14, dy: 2 },
    "4": { horizontal: true, dx: -16, dy: 8 },
    "5": { horizontal: true, dx: -14, dy: 2 },
    "6": { horizontal: true, dx: -14, dy: 2 },
    "7": { horizontal: true, dx: -14, dy: 2 },
    "8": { horizontal: true, dx: -16, dy: 25 },
    "9": { horizontal: true, dx: -16, dy: 30 },

    "（": { rotate: 90, dx: 24, dy: 22 },
　　"）": { rotate: 90, dx: 24, dy: 22 },
   
　　"?": { sideways: true },

　　"ー": { rotate: 90 },

"、": { rotate: 0, dx: 28, dy: -16  },

"。": { rotate: -90, dx: 24, dy: 22  },

"「": { rotate: 90 },
"」": { rotate: 90 },

};

/*

---------------------------------------------------------

本文

---------------------------------------------------------

*/

const POEM = {

    /*

    SVG全体サイズ

    */

    width: 1080,

    height: 1920,

    /*

    文字サイズ

    */

    fontSize: 32,

    /*

    一列ごとのデータ

    */

    columns: [

        /*

        column 0

        */

        {
            
            id: "block1",

    startX: 1790,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    1790,
    1720,
    1650,
    1580,
    1510,
    1440,
    1370,
    1300,
    1230  // 9列目（左端）
],

    columns: [

        "■ど（どど■ど（、どど■うぞと絞って■跨る白熱球お",

        "姉さん■が顔を皮下（脂肪の黄色が■かった層に■はで",

        "（き■なかったね（、■ど（#ド）どとど■ど赤の階調",

        "■の、ど■ど腸■どどど中■にあって、砂浜メ❘トル■",

        "に■打ち寄せ■る  ル■パンの9泡■ですなぁ■ど、",

        "（どど。■明るく挿■入され■ていた背骨デ■ジタルへ",

        "■小学生の■執刀医ジャム（を■指先で■（#レ）■皮",

        "下脂■肪■どど（黄色に■つまむ■。呉服チェ|ン姿■",

        "（は、どど（■階■調マカデミアの■砂浜に■行けば?"

    ]

},

{
    id: "block2",

    startX: 1090,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    1090,
1020,
950,
880,
810,
740,
670,
600
],

    columns: [

        "■（どど（ど●ど（、どど●うぞと打ち寄せ●た一条カ",

        "ンガルー●の泡が●皮膚ソーダに（、割ら●れて●いた",

        "（んだ。っ●ひょうっとして●口内グランデで●割った",

        "の●も●一度（、や二度●サンドウィッチ（#ファ）で、",

        "●はなかったの●だか●ら、早く耳骨アルコール瓶●を",

        "入れ（てみな●さい（なテーブル歯列●に👣を入れな●",

        "（さいな（#ド）。■どど●ど●執刀医ブルー（ベリー、",

        "ら●の指●先が術野●に入ってきた●とき、葦の殺戮だ"

    ]   

},

{
    id: "block3",

    startX: 460,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    460,
    390,
332,
262,
192,
122,
52,
-18,
-88
],

    columns: [

        "（（信号機の●4番目に●ついて👣、ですよね　、　●",

        "（（👣やわらかい●表情だった●ことは　、　👣",

        "（（終わる👣前　、ですし　👣",

        "（👣（👣「?渡りますか」って👣ね　、　👣",

        "（（●あの声👣赤い声👣の横　、　👣　っ　（、",

        "👣（（っ　👣　（　👣",

        "（👣8っ水色の水子👣へと👣水が踏むだけ　、　👣",

        "（（👣ひかって👣いる（のは　、　👣",

        "👣（（👣中絶児たち👣で炊いた👣塗料でしか👣ない　👣"

    ]

},

{
    id: "block4",

    startX: -228,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    -228,
-298,
-368,
-438,
-508,
-578,
-648,
-718,
-788,
-858,
-928
],

    columns: [

        "■どど（👣どど■うか無限●チューリ●ップに（反■復",

        "す（る👣お姉さん●地下通路を■どど（ど👣歩き●な👣、",

        "（がら、●風■景ロドリゲス👣のな●か（、に■ど（粉",

        "■ど（れ込んだ●微細な👣異変を■ど●発見👣するっ（、",

        "と■どど（ど■の👣と👣いうも●のであ👣るが、■どど",

        "（ど■れを●くびって（眼帯スーツケース👣が（こ👣の",

        "■（どど●ゲーム戦場■に（、魅●入ら（（👣れ👣た理、",

        "由は、👣肺の構造8番出口👣が、いる　。■ど●どんな",

        "（に●同じ通●路を（何度も👣歩くあ👣るいている同👣",

        "👣ひん剥き目だま蛍光灯👣の下（、を何■どど（●も通",

        "過する👣していく。👣赤い塗料とも■どど👣ねむりなよ、"

    ]

}

]

};

/*

---------------------------------------------------------

演出タイミング

---------------------------------------------------------

*/

const EFFECTS = {

    /*

    「bar」が現れる位置

    */

    bar: {

        column: null,

        index: null

    },

    /*

    読み終わり

    */

    endColumn: null,

    /*

    シンボル開始

    */

    symbols: {

        square: true,

        circle: true

    },

    /*

    足あと

    */

    footprints: true

};

/*

---------------------------------------------------------

アニメーション速度

---------------------------------------------------------

*/

const SETTINGS = {

    cameraDuration: 700,

    columnDelay: 200,

    symbolDuration: 3000,

    footprintDuration: 5000,

    dissolveDuration: 2500

};