console.log("poemData loaded");

/*

=========================================================

poemData.js

作品データ

=========================================================

*/

/*

---------------------------------------------------------

タイトル

---------------------------------------------------------

*/

const TITLE = {

    characters: [

        { text: "‐", x: 730, y: 115, class: "titleChar" },

        { text: "■", x: 730, y: 185, class: "titleChar" },

        { text: "ど", x: 730, y: 255, class: "titleChar" },

        { text: "︵", x: 730, y: 335, class: "titleChar" },

        { text: "う", x: 730, y: 405, class: "titleChar" },

        { text: "し", x: 730, y: 475, class: "titleChar" },

        { text: "ろ", x: 730, y: 545, class: "titleChar" },

        { text: "■", x: 730, y: 625, class: "titleChar" },

        { text: "︵", x: 730, y: 705, class: "titleChar" },

        { text: "#", x: 730, y: 775, class: "titleChar" },

        { text: "、", x: 730, y: 845, class: "titleChar" }

    ]

};

const AUTHOR = {

    characters: [

        { text: "平", x: 650, y: 1490, class: "authorChar" },

        { text: "川", x: 650, y: 1555, class: "authorChar" },

        { text: "綾", x: 650, y: 1620, class: "authorChar" },

        { text: "真", x: 650, y: 1685, class: "authorChar" },

        { text: "智", x: 650, y: 1750, class: "authorChar" }

    ]

};

/*

---------------------------------------------------------

本文

---------------------------------------------------------

*/

const POEM = {

    /*

    SVG全体サイズ

    */

    width: 1080,

    height: 1920,

    /*

    文字サイズ

    */

    fontSize: 32,

    /*

    一列ごとのデータ

    */

    columns: [

        /*

        column 0

        */

        {
            
            id: "block1",

    startX: 2000,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    2000, // 1列目（右端）
    1935,
    1870,
    1805,
    1740,
    1675,
    1610,
    1545  // 8列目（左端）
],

    columns: [

        "■ど（どど■ど（、どど■うぞと絞って■跨る白熱球お",

        "姉さん■が顔を皮下（脂肪の黄色が■かった層に■はで",

        "（き■なかったね（、■ど(#　ド)どとど■ど赤の階調",

        "■の、ど■ど腸■どどど中■にあって、砂浜メートル■",

        "に■打ち寄せ■る　　　ル■パンの9　泡■ですなぁ■ど、",

        "（どど。■明るく挿■入され■ていた背骨デ■ジタルへ",

        "■小学生の■執刀医ジャム（を■指先で■（#　レ）■皮、",

        "下脂■肪■どど（黄色に■つまむ■。呉服チェーン姿■",

        "（は、どど（■階■調マカデミアの■砂浜に■行けば？"

    ]

},

{
    id: "block2",

    startX: 1415,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    1415,
1350,
1285,
1220,
1155,
1090,
1025,
960
],

    columns: [

        "■（どど（ど●ど（、どど●うぞと打ち寄せ●た一条カ",

        "ンガルー●の泡が●皮膚ソーダに（、割ら●れて●いた",

        "（んだ。っ●ひょうっとして●口内 グランデで●割った",

        "の●も●一度（、や二度●サンドウィッチ（#　ファ）で、",

        "●はなかったの●だか●ら、早く鼻骨アルコール瓶●を",

        "入れ(てみな●さい（なテーブル歯列●に👣を入れな●",

        "（さいな(#　ド)。■どど●ど●執刀医ブルー（ベリー、",

        "ら●の指●先が術野●に入ってきた●とき、葦の殺戮だ"

    ]   

},

{
    id: "block3",

    startX: 420,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    390,
332,
274,
216,
158,
100,
42,
-16,
-74
],

    columns: [

        "（（信号機の●4番目に●ついて👣、ですよね　、　●",

        "（（👣やわらかい●表情だった●ことは　、　👣",

        "（（終わる👣前　、ですし　👣",

        "（👣　(👣　「？渡りますか」って👣ね　、　👣",

        "（（●あの声👣赤い声👣の横　、　👣　っ　（、",

        "👣　（（っ　👣　（　👣",

        "（👣　（っ水色の水子👣 へと👣水が踏むだけ　、　👣",

        "（（👣ひかって👣いる（のは　、　👣",

        "👣　（（👣中絶児たち👣で炊いた👣 塗料でしか👣ない　👣"

    ]

},

{
    id: "block4",

    startX: -30,

    startY: 150,

    columnGap: 56,

    lineGap: 65,

    xPositions: [
    -130,
-188,
-246,
-304,
-362,
-420,
-478,
-536
],

    columns: [

        "どど（👣どど■うか無限●チューリ●ップに（反■復",

        "す（る👣お姉さん●地下通路を■どど（ど👣歩き●な👣、",

        "（がら、●風■景ロドリゲス👣のな●か（、に■ど（粉",

        "■ど（れ込んだ●微細な👣異変を■ど●発見👣するっ（、",

        "と■どど（ど■の👣と👣いうも●のであ👣るが、■どど",

        "（ど■れを●くびって（眼帯スーツケース👣が（こ👣の",

        "■（どど●ゲーム戦場■に（、魅●入ら（（👣れ👣た理、",

        "由は、👣肺の構造8 番出口👣が、いる　。■ど●どんな",

        "（に●同じ通●路を(何度も👣歩くあ👣るいている同👣",

        "👣ひん剥き目だま蛍光灯👣の下（、を何■どど（●も通",

        "過する👣していく。👣赤い塗料とも■どど👣ねむりなよ、"

    ]

}

]

};

/*

---------------------------------------------------------

演出タイミング

---------------------------------------------------------

*/

const EFFECTS = {

    /*

    「bar」が現れる位置

    */

    bar: {

        column: null,

        index: null

    },

    /*

    読み終わり

    */

    endColumn: null,

    /*

    シンボル開始

    */

    symbols: {

        square: true,

        circle: true

    },

    /*

    足あと

    */

    footprints: true

};

/*

---------------------------------------------------------

アニメーション速度

---------------------------------------------------------

*/

const SETTINGS = {

    cameraDuration: 700,

    columnDelay: 200,

    symbolDuration: 3000,

    footprintDuration: 5000,

    dissolveDuration: 2500

};